INSERT INTO publications (publication_id, title, bio, cover_image_url) VALUES
(1, 'প্রতীক প্রকাশনা সংস্থা', '', ''),
(2, 'অন্যপ্রকাশ', '', ''),
(3, 'কাকলী প্রকাশনী', '', ''),
(4, 'বিশ্বভারতী গ্রন্থনবিভাগ', '', ''),
(5, 'ঐতিহ্য', '', ''),
(6, 'অবসর', '', ''),
(7, 'নজরুল ইনস্টিটিউট', '', ''),
(8, 'আনন্দ পাবলিশার্স', '', ''),
(9, 'সময় প্রকাশন', '', ''),
(10, 'রিয়া প্রকাশনী', '', ''),
(11, 'অনুভূতি প্রকাশনী', '', ''),
(12, 'সূর্যোদয় প্রকাশন', '', ''),
(13,'দূরবীণ','','');

UPDATE publications
SET bio = CASE publication_id
    WHEN 1 THEN 'বাংলাদেশের একটি শীর্ষস্থানীয় প্রকাশনা সংস্থা, যা প্রধানত কথাসাহিত্য এবং সংকলন প্রকাশের জন্য পরিচিত।'
    WHEN 2 THEN 'বাংলাদেশের অন্যতম বৃহৎ ও জনপ্রিয় প্রকাশনী, বিশেষ করে হুমায়ূন আহমেদের বই প্রকাশের জন্য এটি সুপরিচিত।'
    WHEN 3 THEN 'জনপ্রিয় ধারার সাহিত্য, শিশুতোষ গ্রন্থ এবং সমকালীন উপন্যাস প্রকাশের জন্য একটি বিখ্যাত প্রকাশনী।'
    WHEN 4 THEN 'রবীন্দ্রনাথ ঠাকুরের সাহিত্যকর্মের আদি ও প্রামাণ্য সংস্করণ প্রকাশের দায়িত্বে নিয়োজিত ঐতিহাসিক প্রকাশনা বিভাগ।'
    WHEN 5 THEN 'ধ্রুপদী ও আধুনিক বাংলা সাহিত্য, ইতিহাস এবং গবেষণামূলক বই প্রকাশের জন্য সুপরিচিত প্রকাশনা সংস্থা।'
    WHEN 6 THEN 'বিশ্বখ্যাত সাহিত্যের বাংলা অনুবাদ এবং প্রথাবিরোধী মানসম্পন্ন কথাসাহিত্য প্রকাশের জন্য পরিচিত।'
    WHEN 7 THEN 'জাতীয় কবি কাজী নজরুল ইসলামের সাহিত্যকর্ম সংরক্ষণ, গবেষণা এবং তাঁর সামগ্রিক সৃষ্টি প্রকাশের জন্য রাষ্ট্রীয় প্রতিষ্ঠান।'
    WHEN 8 THEN 'ভারতের কলকাতার একটি শীর্ষস্থানীয় ও ঐতিহ্যবাহী প্রকাশনা সংস্থা, যা দুই বাংলার পাঠকদের কাছে অত্যন্ত জনপ্রিয়।'
    WHEN 9 THEN 'বিজ্ঞানমনস্ক প্রবন্ধ, সৃজনশীল সাহিত্য এবং মুক্তিযুদ্ধভিত্তিক গ্রন্থ প্রকাশের জন্য একটি বিশিষ্ট প্রকাশনী।'
    WHEN 10 THEN 'সমকালীন বাংলা সাহিত্যের মানসম্পন্ন বই এবং ধ্রুপদী সাহিত্যের সুলভ সংস্করণ প্রকাশের জন্য পরিচিত।'
    WHEN 11 THEN 'সৃজনশীল কথাসাহিত্য এবং ক্লাসিক বাংলা সাহিত্যের নতুন সংস্করণ প্রকাশের কাজে যুক্ত একটি প্রকাশনী।'
    WHEN 12 THEN 'কিশোর সাহিত্য, ফিকশন এবং ধ্রুপদী সাহিত্যের সুলভ সংস্করণ মুদ্রণের জন্য পরিচিত।'
    WHEN 13 THEN 'জনপ্রিয় ক্লাসিক বাংলা সাহিত্যকর্মগুলোর নান্দনিক ও সাশ্রয়ী হার্ডকভার সংস্করণ প্রকাশের জন্য পরিচিত।'
    ELSE bio
END
WHERE publication_id IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13);



select *
from publications

